change = {'^' : '**', 'sin' : 'np.sin', 'cos' : 'np.cos', 'tan' : 'np.tan', 'arcsin' : 'np.arcsin',\
           'arccos' : 'np.arccos', 'arctan' : 'np.arctan', 'exp' : 'np.exp', \
            'log' : 'np.log', 'round' : 'np.round', 'floor' : 'np.floor', \
                'ceil' : 'np.ceil', 'trunc' : 'np.trunc'}

egn_to_rus = {'f' : 'а',  ',' : 'б', 'd' : 'в', 'u' : 'г', 'l' : 'д', 't' : 'е', '`' : 'ё', ';'  : 'ж',\
               'p'  : 'з', 'b'  : 'и', 'r'  : 'к',  'k' : 'л', 'v' : 'м', 'y' : 'н', 'j' : 'о',\
                  'g' : 'п', 'h' : 'р', 'c' : 'с', 'n' : 'т', 'e' : 'у', 'a' : 'ф', '[' : 'х',\
                      'w' : 'ц', 'x' : 'ч', 'i' : 'ш', 'o' : 'щ', ']' : 'ъ', 's' : 'ы',\
                          'm' : 'ь', "'" : 'э', '.' : 'ю', 'z' : 'я', }

rus_to_eng = {'а' : 'f', 'б' : ',', 'в' : 'd', 'г' : 'u', 'д' : 'l', 'е' : 't', 'ё' : '`', 'ж' : ';',\
            'з' : 'p', 'и' : 'b', 'к' : 'r', 'л' : 'k', 'м' : 'v', 'н' : 'y', 'о' : 'j', 'п' : 'g',\
            'р' : 'h', 'с' : 'c', 'т' : 'n', 'у' : 'e', 'ф' : 'a', 'х' : '[', 'ц' : 'w', 'ч' : 'x',\
            'ш' : 'i', 'щ' : 'o', 'ъ' : ']', 'ы' : 's', 'ь' : 'm', 'э' : "'", 'ю' : '.', 'я' : 'z'}